paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
// 
// 
// 


#include <WiFi.h>
#include <WiFiClient.h>
#include <ESP32Encoder.h>
#include <AceButton.h>
using namespace ace_button; 

#include "setup.h"
#include "gui.h"
#include "network.h"
#include "vfo.h"
#include "wifigui.h"
#include "io.h"
#include "smeter.h"

#define LVGL_TICK_PERIOD 60
#define ROTARY_A      14      
#define ROTARY_B      19
#define ROTARY_PRESS  26

LV_FONT_DECLARE(FreeSansOblique42);
LV_FONT_DECLARE(FreeSansOblique32);

/*-------------------------------------------------------
   Optical Rotary encoder settings (used for frequency)
--------------------------------------------------------*/
#define PULSE_INPUT_PIN 34  // Rotaty Encoder A
#define PULSE_CTRL_PIN  35  // Rotaty Encoder B

ESP32Encoder    Enc_vfo;

/*-------------------------------------------------------
   Rotary hardware connection (used for bandswitching, and mode switching)
--------------------------------------------------------*/
static	ESP32Encoder	GuiEncoder;
static	volatile int	enc_button_state = LV_INDEV_STATE_REL;
AceButton				rotary_button(ROTARY_PRESS);
void					rotary_button_eventhandler(AceButton*, uint8_t, uint8_t);

int active_vfo = 0;  // holds which vfo is active selected using radio buttons

//Ticker tick; /* timer for interrupt handler */
TFT_eSPI tft = TFT_eSPI(); /* TFT instance */
static lv_disp_buf_t disp_buf;
static lv_color_t buf[LV_HOR_RES_MAX * 10];

lv_obj_t* slider_label;
const int screenWidth = 320;
const int screenHeight = 240;
const int bottomHeight = 40;
const int topHeight = 25;
const int nobuttons = 6;
const int bottombutton_width = (screenWidth / nobuttons) - 2;
const int bottombutton_width1 = (screenWidth / nobuttons);

lv_obj_t* ddlist;
lv_obj_t* bg_top;
lv_obj_t* bg_middle;
lv_obj_t* mbox_connect;
lv_obj_t* gauge;
lv_obj_t* label_status;
lv_obj_t* s_meter;
lv_obj_t* usb_button;
lv_obj_t* lsb_button;
lv_obj_t* vfo_frequency;
lv_obj_t* vfo2_frequency;
lv_obj_t* label_wifi;
lv_obj_t* vfo_unit;
lv_obj_t* vfo2_unit;
lv_obj_t* vfo1_button;
lv_obj_t* vfo2_button;
lv_obj_t* band_button;
lv_obj_t* save_button;
lv_obj_t* Band_btn_label;
lv_obj_t* Tx_led1;
lv_obj_t* bfo_label;
lv_obj_t* s_canvas;
lv_obj_t* bg_middle2;
lv_obj_t* bg_middle3;
lv_obj_t* si_spinbox;
lv_obj_t* si_spinbox2;
lv_obj_t* Swr_gauge;
lv_obj_t* pwr_gauge;
lv_obj_t* swr_vlabel;
lv_obj_t* pwr_vlabel;
lv_obj_t* bg_calgui;
lv_obj_t* ad_spinbox1;
lv_obj_t* ad_spinbox2;
lv_obj_t* ad_spinbox3;
lv_obj_t* ad_spinbox4;
lv_obj_t* fwd_label1;
lv_obj_t* bg_top_cal;
lv_obj_t* btn_fwd;
lv_obj_t* btn_rev;
lv_obj_t* label_cal;
lv_obj_t* watt_cal;
lv_obj_t* btn_matrix;

lv_group_t* vfo_group;
lv_group_t* si_5351_group;
lv_group_t* setup_group;
lv_group_t* cal_group;
lv_indev_t* encoder_indev_t;

CSmeter* smeter;

static lv_color_t* cbuf;
static lv_style_t cal_led_style;

// VFO States
// The VFO can be in different states:
// f_rxtx determines if the VFO is in receive or transmit mode
// f_cal_ad8307 determines if the VFO is calibrating the ad8307 for this the system need to measure the input of the ADC to a fixed dbm value
// active_vfo determines if VFO 0 or VFO 1 is active

static bool f_cal_ad8307 = false;

#if USE_LV_LOG != 0
/* Serial debugging */
void my_print(lv_log_level_t level, const char* file, uint32_t line, const char* dsc)
{

	Serial.printf("%s@%d->%s\r\n", file, line, dsc);
	delay(100);
}
#endif



bool read_encoder(lv_indev_drv_t* indev, lv_indev_data_t* data)
{
	data->enc_diff = GuiEncoder.getCount();
	GuiEncoder.clearCount();
	data->state = enc_button_state;	
	if (data->enc_diff > 0)
		data->enc_diff = 1;
	if (data->enc_diff < 0)
		data->enc_diff = -1;
	return false;
}

static void lv_gauge_format_swr(lv_obj_t* gauge, char* buf, int bufsize, int32_t value)
{
	// 1:1
	snprintf(buf, bufsize, "%d.%d", (value / 10) % 10, (value) % 10);
}

static void lv_gauge_format_pwr(lv_obj_t* gauge, char* buf, int bufsize, int32_t value)
{
	snprintf(buf, bufsize, "%d.%d", value / 10, (value) % 10);
}

void guisetup() {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	pinMode(ROTARY_PRESS, INPUT);
	rotary_button.setEventHandler(rotary_button_eventhandler);
	rotary_button.getButtonConfig()->setFeature(ButtonConfig::kFeatureLongPress);
	rotary_button.getButtonConfig()->setFeature(ButtonConfig::kFeatureSuppressAfterLongPress);
	ESP32Encoder::useInternalWeakPullResistors = NONE;
	GuiEncoder.attachHalfQuad(ROTARY_B, ROTARY_A, 1024);
	Enc_vfo.attachHalfQuad(PULSE_INPUT_PIN, PULSE_CTRL_PIN);

	xTaskCreate(guiTask,
		"gui",
		4096 * 2,
		NULL,
		2,
		NULL);
}

void guiTask(void* arg) {

	
	lv_init();

#if USE_LV_LOG != 0
	lv_log_register_print_cb(my_print); /* register print function for debugging */
#endif

	tft.begin(); /* TFT init */
	tft.setRotation(1);

	uint16_t calData[5] = { 275, 3620, 264, 3532, 1 };
	tft.setTouch(calData);

	lv_disp_buf_init(&disp_buf, buf, NULL, LV_HOR_RES_MAX * 10);

	/*Initialize the display*/
	lv_disp_drv_t disp_drv;
	lv_disp_drv_init(&disp_drv);
	disp_drv.hor_res = screenWidth;
	disp_drv.ver_res = screenHeight;
	disp_drv.flush_cb = my_disp_flush;
	disp_drv.buffer = &disp_buf;
	lv_disp_drv_register(&disp_drv);

	/*Initialize the input device driver*/
	lv_indev_drv_t indev_drv;
	lv_indev_drv_init(&indev_drv);             /*Descriptor of a input device driver*/
	indev_drv.type = LV_INDEV_TYPE_POINTER;    /*Touch pad is a pointer-like device*/
	indev_drv.read_cb = my_touchpad_read;      /*Set your driver function*/
	lv_indev_drv_register(&indev_drv);         /*Finally register the driver*/

	lv_indev_drv_t indev_drv_enc; 
	lv_indev_drv_init(&indev_drv_enc);
	indev_drv_enc.type = LV_INDEV_TYPE_ENCODER;
	indev_drv_enc.read_cb = read_encoder;
	encoder_indev_t = lv_indev_drv_register(&indev_drv_enc);

	//Set the theme..
	lv_theme_t* th = lv_theme_material_init(LV_THEME_DEFAULT_COLOR_PRIMARY, LV_THEME_DEFAULT_COLOR_SECONDARY, LV_THEME_MATERIAL_FLAG_DARK, LV_THEME_DEFAULT_FONT_SMALL, LV_THEME_DEFAULT_FONT_NORMAL, LV_THEME_DEFAULT_FONT_SUBTITLE, LV_THEME_DEFAULT_FONT_TITLE);
	lv_theme_set_act(th);

	lv_obj_t* scr = lv_cont_create(NULL, NULL);
	lv_disp_load_scr(scr);

	bg_top = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_top, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_NAVY);
	lv_obj_set_size(bg_top, LV_HOR_RES, topHeight);

	label_status = lv_label_create(bg_top, NULL);
	lv_label_set_long_mode(label_status, LV_LABEL_LONG_SROLL_CIRC);
	lv_obj_set_width(label_status, LV_HOR_RES - 20);
	lv_label_set_text(label_status, "");
	lv_obj_align(label_status, NULL, LV_ALIGN_CENTER, 20, 0);

	bg_middle = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle, 0, topHeight);
	lv_obj_set_size(bg_middle, LV_HOR_RES, screenHeight - topHeight);

