paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	smeter = new CSmeter(bg_middle, LV_ALIGN_CENTER, 255, 50, 0, 30);

	// Create groups for encoder support for the different screens
	vfo_group = lv_group_create();
	lv_indev_set_group(encoder_indev_t, vfo_group);
	
	static lv_style_t style_btn;
	lv_style_init(&style_btn);

	lv_style_set_radius(&style_btn, LV_STATE_DEFAULT, 10);
	lv_style_set_bg_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x60, 0x60, 0x60));
	lv_style_set_bg_grad_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x00, 0x00, 0x00));
	lv_style_set_bg_grad_dir(&style_btn, LV_STATE_DEFAULT, LV_GRAD_DIR_VER);
	lv_style_set_bg_opa(&style_btn, LV_STATE_DEFAULT, 255);
	lv_style_set_border_color(&style_btn, LV_STATE_DEFAULT, lv_color_make(0x9b, 0x36, 0x36) ); // lv_color_make(0x2e, 0x44, 0xb2)
	lv_style_set_border_width(&style_btn, LV_STATE_DEFAULT, 2);
	lv_style_set_border_opa(&style_btn, LV_STATE_DEFAULT, 255);
	lv_style_set_outline_color(&style_btn, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_outline_opa(&style_btn, LV_STATE_DEFAULT, 255);
	
	lv_style_set_border_width(&style_btn, LV_STATE_FOCUSED, 2);
	lv_style_set_outline_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_RED);
	//lv_style_set_border_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_WHITE);
	//lv_style_set_outline_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_WHITE);
	//lv_style_set_bg_color(&style_btn, LV_STATE_FOCUSED, LV_COLOR_OLIVE);

	//lv_style_set_border_color(&style_btn, LV_STATE_CHECKED, lv_color_make(0x9b, 0x36, 0x36)); // lv_color_make(0x2e, 0x44, 0xb2)
	//lv_style_set_border_color(&style_btn, LV_STATE_CHECKED, LV_COLOR_BLACK); // lv_color_make(0x2e, 0x44, 0xb2)
	//lv_style_set_border_width(&style_btn, LV_STATE_CHECKED, 2);

	/*Set the text style*/
	lv_style_set_text_color(&style_btn, LV_STATE_DEFAULT, LV_COLOR_WHITE);

	lsb_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(lsb_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(lsb_button, mode_button_eh);
	lv_obj_align(lsb_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 0, 0);
	lv_btn_set_checkable(lsb_button, true);
	lv_btn_toggle(lsb_button);
	lv_obj_set_size(lsb_button, bottombutton_width, bottomHeight);
	lv_obj_t* label = lv_label_create(lsb_button, NULL);
	lv_label_set_text(label, "Lsb");
	
	usb_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(usb_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(usb_button, mode_button_eh);
	lv_obj_align(usb_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, bottombutton_width1, 0);
	lv_btn_set_checkable(usb_button, true);
	lv_obj_set_size(usb_button, bottombutton_width, bottomHeight);
	label = lv_label_create(usb_button, NULL);
	lv_label_set_text(label, "Usb");
	
	vfo1_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(vfo1_button, LV_BTN_PART_MAIN, &style_btn); 
	lv_obj_set_event_cb(vfo1_button, mode_button_vfo);
	lv_obj_align(vfo1_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 2 * bottombutton_width1, 0);
	lv_btn_set_checkable(vfo1_button, true);
	lv_btn_toggle(vfo1_button);
	lv_obj_set_size(vfo1_button, bottombutton_width, bottomHeight);
	label = lv_label_create(vfo1_button, NULL);
	lv_label_set_text(label, "Vfo 1");
	
	vfo2_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(vfo2_button, LV_BTN_PART_MAIN, &style_btn); 
	lv_obj_set_event_cb(vfo2_button, mode_button_vfo);
	lv_obj_align(vfo2_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 3 * bottombutton_width1, 0);
	lv_btn_set_checkable(vfo2_button, true);
	lv_obj_set_size(vfo2_button, bottombutton_width, bottomHeight);
	label = lv_label_create(vfo2_button, NULL);
	lv_label_set_text(label, "Vfo 2");
	
	band_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(band_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(band_button, event_band_button);
	lv_obj_align(band_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 4 * bottombutton_width1, 0);
	lv_obj_set_size(band_button, bottombutton_width, bottomHeight);
	Band_btn_label = lv_label_create(band_button, NULL);
	lv_label_set_text(Band_btn_label, "80m");

	save_button = lv_btn_create(bg_middle, NULL);
	lv_obj_add_style(save_button, LV_BTN_PART_MAIN, &style_btn);
	lv_obj_set_event_cb(save_button, event_button_save);
	lv_obj_align(save_button, NULL, LV_ALIGN_IN_BOTTOM_LEFT, 5 * bottombutton_width1, 0);
	lv_obj_set_size(save_button, bottombutton_width, bottomHeight);
	label = lv_label_create(save_button, NULL);
	lv_label_set_text(label, "Save");

	static lv_style_t text_style;
	lv_style_init(&text_style);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style, LV_STATE_DEFAULT, &FreeSansOblique42);

	vfo_frequency = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(vfo_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(vfo_frequency, LV_OBJ_PART_MAIN, &text_style);
	lv_obj_set_width(vfo_frequency, LV_HOR_RES - 20);
	lv_label_set_text(vfo_frequency, "");
	lv_obj_set_height(vfo_frequency, 40);
	lv_obj_align(vfo_frequency, bg_middle, LV_ALIGN_CENTER, -30, -84);
	lv_label_set_align(vfo_frequency, LV_LABEL_ALIGN_CENTER);

	vfo_unit = lv_label_create(bg_middle, NULL);
	lv_obj_add_style(vfo_unit, LV_OBJ_PART_MAIN, &text_style);
	lv_label_set_text(vfo_unit, "Khz");
	lv_obj_set_height(vfo_unit, 40);
	lv_obj_align(vfo_unit, bg_middle, LV_ALIGN_CENTER, 110, -87);
	lv_label_set_align(vfo_unit, LV_LABEL_ALIGN_CENTER);

	static lv_style_t text_style12;
	lv_style_init(&text_style12);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style12, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style12, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style12, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style12, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style12, LV_STATE_DEFAULT, &FreeSansOblique32);
	lv_style_set_text_color(&text_style12, LV_STATE_DEFAULT, LV_COLOR_OLIVE);

	vfo2_frequency = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(vfo2_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(vfo2_frequency, LV_OBJ_PART_MAIN, &text_style12);
	lv_obj_set_width(vfo2_frequency, LV_HOR_RES - 20);
	lv_label_set_text(vfo2_frequency, "28.000.00");
	lv_obj_set_height(vfo2_frequency, 40);
	lv_obj_align(vfo2_frequency, bg_middle, LV_ALIGN_CENTER, -35, -44);
	lv_label_set_align(vfo2_frequency, LV_LABEL_ALIGN_CENTER);
	
	vfo2_unit = lv_label_create(bg_middle, NULL);
	lv_obj_add_style(vfo2_unit, LV_OBJ_PART_MAIN, &text_style12);
	lv_label_set_text(vfo2_unit, "Khz");
	lv_obj_set_height(vfo2_unit, 40);
	lv_obj_align(vfo2_unit, bg_middle, LV_ALIGN_CENTER, 120, -49);
	lv_label_set_align(vfo2_unit, LV_LABEL_ALIGN_CENTER);

	bfo_label = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(bfo_label, LV_LABEL_LONG_CROP);
	lv_obj_set_width(bfo_label, 120);
	lv_label_set_text(bfo_label, "8998.0");
	lv_obj_align(bfo_label, NULL, LV_ALIGN_IN_LEFT_MID, 10, -30);

	label_wifi = lv_label_create(bg_top, NULL);
	lv_label_set_long_mode(label_wifi, LV_LABEL_LONG_SROLL_CIRC);
	lv_obj_set_width(label_wifi, LV_HOR_RES - 20);
	lv_label_set_text(label_wifi, LV_SYMBOL_WIFI);
	lv_obj_align(label_wifi, NULL, LV_ALIGN_IN_TOP_LEFT, 0, 5);
	lv_obj_set_hidden(label_wifi, true);

	Tx_led1 = lv_led_create(bg_middle, NULL);
	lv_obj_align(Tx_led1, NULL, LV_ALIGN_CENTER, -125, -70);
	lv_led_off(Tx_led1);
	lv_obj_set_size(Tx_led1, 20, 20);
	
