paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	}
}

static void gui_setup(lv_obj_t* scr)
{
	static const char* setup_btnm_map[] = { LV_SYMBOL_WIFI, "Si5351", "Calibrate\n AD8307", "Reset", "" };

	bg_middle2 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle2, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle2, 0, topHeight);
	lv_obj_set_size(bg_middle2, LV_HOR_RES, screenHeight - topHeight - bottomHeight);
	lv_obj_move_background(bg_middle2);

	btn_matrix = lv_btnmatrix_create(bg_middle2, NULL);
	lv_btnmatrix_set_map(btn_matrix, setup_btnm_map);
	lv_obj_align(btn_matrix, NULL, LV_ALIGN_CENTER, 0, 0);
	lv_btnmatrix_set_btn_ctrl(btn_matrix, 6, LV_BTNMATRIX_CTRL_CHECKABLE);
	lv_obj_set_event_cb(btn_matrix, gui_setup_event_handler);
	setup_group = lv_group_create();
	lv_group_add_obj(setup_group, btn_matrix);

	lv_obj_t* pwd_label1 = lv_label_create(bg_middle2, NULL);
	lv_label_set_text(pwd_label1, "Setup");
	lv_obj_align(pwd_label1, btn_matrix, LV_ALIGN_OUT_TOP_LEFT, 0, 0);
}

static void lv_spinbox_increment_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(si_spinbox);
		R.correction_si5351_no1 = lv_spinbox_get_value(si_spinbox);
		cal_vfo();
	}
}

static void lv_spinbox_decrement_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(si_spinbox);
		R.correction_si5351_no1 = lv_spinbox_get_value(si_spinbox);
		cal_vfo();
	}
}

static void lv_spinbox_increment_event_si2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(si_spinbox2);
		R.correction_si5351_no2 = lv_spinbox_get_value(si_spinbox);
		cal_bfo();
	}
}

static void lv_spinbox_decrement_event_si2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(si_spinbox2);
		R.correction_si5351_no2 = lv_spinbox_get_value(si_spinbox);
		cal_bfo();
	}
}

static void lv_spinbox_save_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		SaveEEPROM();
		updateBottomStatus(LV_COLOR_GREEN, "Si5351 calibration saved", 0);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void lv_spinbox_cancel_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void gui_si5351(lv_obj_t* scr)
{
	bg_middle3 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle3, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle3, 0, topHeight);
	lv_obj_set_size(bg_middle3, LV_HOR_RES, screenHeight - topHeight - bottomHeight);
	lv_obj_move_background(bg_middle3);

	si_5351_group = lv_group_create();
	
	si_spinbox = lv_spinbox_create(bg_middle3, NULL);
	lv_spinbox_set_range(si_spinbox, -150000, 150000);
	lv_spinbox_set_digit_format(si_spinbox, 7, 0);
	lv_spinbox_step_prev(si_spinbox);
	lv_obj_set_width(si_spinbox, 120);
	lv_obj_align(si_spinbox, NULL, LV_ALIGN_CENTER, 0, -50);
	lv_spinbox_set_value(si_spinbox, 0);
	
	lv_obj_t* pwd_label1 = lv_label_create(bg_middle3, NULL);
	lv_label_set_text(pwd_label1, "Vfo Si5351");
	lv_obj_align(pwd_label1, si_spinbox, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

	lv_coord_t h = lv_obj_get_height(si_spinbox);
	lv_obj_t* btn_plus1 = lv_btn_create(bg_middle3, NULL);
	lv_obj_set_size(btn_plus1, h, h);
	lv_obj_align(btn_plus1, si_spinbox, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn_plus1, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_plus1, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn_plus1, lv_spinbox_increment_event_si);

	lv_obj_t* btn_min1= lv_btn_create(bg_middle3, btn_plus1);
	lv_obj_align(btn_min1, si_spinbox, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn_min1, lv_spinbox_decrement_event_si);
	lv_obj_set_style_local_value_str(btn_min1, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);

	lv_group_add_obj(si_5351_group, btn_min1);
	lv_group_add_obj(si_5351_group, si_spinbox);
	lv_group_add_obj(si_5351_group, btn_plus1);

	si_spinbox2 = lv_spinbox_create(bg_middle3, NULL);
	lv_spinbox_set_range(si_spinbox2, -150000, 150000);
	lv_spinbox_set_digit_format(si_spinbox2, 7, 0);
	lv_spinbox_step_prev(si_spinbox2);
	lv_obj_set_width(si_spinbox2, 120);
	lv_obj_align(si_spinbox2, NULL, LV_ALIGN_CENTER, 0, +20);
	lv_spinbox_set_value(si_spinbox2, 0);

	pwd_label1 = lv_label_create(bg_middle3, NULL);
	lv_label_set_text(pwd_label1, "Bfo Si5351");
	lv_obj_align(pwd_label1, si_spinbox2, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

	h = lv_obj_get_height(si_spinbox2);
	lv_obj_t* btn_plus2 = lv_btn_create(bg_middle3, NULL);
	lv_obj_set_size(btn_plus2, h, h);
	lv_obj_align(btn_plus2, si_spinbox2, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn_plus2, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_plus2, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn_plus2, lv_spinbox_increment_event_si2);

	lv_obj_t* btn_min2 = lv_btn_create(bg_middle3, btn_plus2);
	lv_obj_align(btn_min2, si_spinbox2, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn_min2, lv_spinbox_decrement_event_si2);
	lv_obj_set_style_local_value_str(btn_min2, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);

	lv_group_add_obj(si_5351_group, btn_min2);
	lv_group_add_obj(si_5351_group, si_spinbox2);
	lv_group_add_obj(si_5351_group, btn_plus2);

	lv_obj_t* btn_save = lv_btn_create(bg_middle3, NULL);
	lv_obj_align(btn_save, NULL, LV_ALIGN_CENTER, -70, 70);
	lv_theme_apply(btn_save, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_save, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "Save");
	lv_obj_set_event_cb(btn_save, lv_spinbox_save_event_si);

	lv_obj_t* btn_cancel = lv_btn_create(bg_middle3, NULL);
	lv_obj_align(btn_cancel, NULL, LV_ALIGN_CENTER, 70, 70);
	lv_theme_apply(btn_cancel, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_cancel, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "Cancel");
	lv_obj_set_event_cb(btn_cancel, lv_spinbox_cancel_event_si);

	lv_group_add_obj(si_5351_group, btn_save); 
	lv_group_add_obj(si_5351_group, btn_cancel);
}

static void mode_button_cal_cancel(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		lv_obj_move_background(bg_calgui);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_top_cal);
		lv_obj_move_foreground(bg_top);
		f_cal_ad8307 = false;
		start_measurement();
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void mode_button_cal_save(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		lv_obj_move_background(bg_calgui);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_top_cal);
		lv_obj_move_foreground(bg_top);
		f_cal_ad8307 = false;
		Serial.println("db10m[0]: " + String(R.cal_AD[0].db10m) + " Fwd[0]: " + String(R.cal_AD[0].Fwd) + " Rev[0]: " + String(R.cal_AD[0].Rev));
		Serial.println("db10m[1]: " + String(R.cal_AD[1].db10m) + " Fwd[1]: " + String(R.cal_AD[1].Fwd) + " Rev[1]: " + String(R.cal_AD[1].Rev));
		start_measurement();
		SaveEEPROM();
		lv_indev_set_group(encoder_indev_t, vfo_group);
	}
}

static void lv_spinbox_increment_event_ad1(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox1);
		R.cal_AD[0].db10m = lv_spinbox_get_value(ad_spinbox1);
	}
}

static void lv_spinbox_decrement_event_ad1(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox1);
		R.cal_AD[0].db10m = lv_spinbox_get_value(ad_spinbox1);
	}
}

static void lv_spinbox_increment_event_ad2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox2);
		R.cal_AD[1].db10m = lv_spinbox_get_value(ad_spinbox2);
	}
}

static void lv_spinbox_increment_event_ad4(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox4);
		R.cal_AD[1].Fwd = (double)lv_spinbox_get_value(ad_spinbox4) / 1000.0;
	}
}

static void lv_spinbox_decrement_event_ad3(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox3);
		R.scale_watt = lv_spinbox_get_value(ad_spinbox3);
	}
}

static void lv_spinbox_increment_event_ad3(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(ad_spinbox3);
		R.scale_watt = lv_spinbox_get_value(ad_spinbox3);
	}
}

static void lv_spinbox_decrement_event_ad2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox2);
		R.cal_AD[1].db10m = lv_spinbox_get_value(ad_spinbox2);
	}
}

static void lv_spinbox_decrement_event_ad4(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(ad_spinbox4);
		R.cal_AD[1].Fwd = (double)lv_spinbox_get_value(ad_spinbox4) / 1000.0;
	}
}

static void lv_spinbox_event_save(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		
