paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	lv_obj_t* btn_cancel = lv_btn_create(bg_top_cal, NULL);
	lv_obj_set_event_cb(btn_cancel, mode_button_cal_cancel);
	lv_obj_align(btn_cancel, NULL, LV_ALIGN_IN_TOP_LEFT, 60, 5);
	lv_obj_set_size(btn_cancel, 50, 20);
	lv_obj_set_style_local_value_str(btn_cancel, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "Cancel");
	
	lv_obj_t* btn_plus3 = lv_btn_create(bg_calgui, NULL);
	lv_obj_set_size(btn_plus3, h, h);
	lv_obj_align(btn_plus3, ad_spinbox3, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn_plus3, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_plus3, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn_plus3, lv_spinbox_increment_event_ad3);

	lv_obj_t* btn_min3 = lv_btn_create(bg_calgui, btn_plus3);
	lv_obj_align(btn_min3, ad_spinbox3, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn_min3, lv_spinbox_decrement_event_ad3);
	lv_obj_set_style_local_value_str(btn_min3, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);

	lv_obj_t* btn_plus4 = lv_btn_create(bg_calgui, NULL);
	lv_obj_set_size(btn_plus4, h, h);
	lv_obj_align(btn_plus4, ad_spinbox4, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn_plus4, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_plus4, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn_plus4, lv_spinbox_increment_event_ad4);

	lv_obj_t* btn_min4 = lv_btn_create(bg_calgui, btn_plus4);
	lv_obj_align(btn_min4, ad_spinbox4, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn_min4, lv_spinbox_decrement_event_ad4);
	lv_obj_set_style_local_value_str(btn_min4, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);

	lv_obj_t* btn_ok4 = lv_btn_create(bg_calgui, NULL);
	lv_obj_set_size(btn_ok4, h, h);
	lv_obj_align(btn_ok4, ad_spinbox4, LV_ALIGN_OUT_RIGHT_MID, 40, 0);
	lv_theme_apply(btn_ok4, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_ok4, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "R1");
	lv_obj_set_event_cb(btn_ok4, lv_spinbox_event_save4);

	lv_obj_t* btn_ok5 = lv_btn_create(bg_calgui, NULL);
	lv_obj_set_size(btn_ok5, h, h);
	lv_obj_align(btn_ok5, ad_spinbox4, LV_ALIGN_OUT_RIGHT_MID, 80, 0);
	lv_theme_apply(btn_ok5, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_ok5, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "R2");
	lv_obj_set_event_cb(btn_ok5, lv_spinbox_event_save5);

//	pwd_label1 = lv_label_create(bg_calgui, NULL);
//	lv_label_set_text(pwd_label1, "Watt");
//	lv_obj_align(pwd_label1, btn_min3, LV_ALIGN_OUT_LEFT_MID, -10,0);

	lv_group_add_obj(cal_group, btn_min1);
	lv_group_add_obj(cal_group, ad_spinbox1);
	lv_group_add_obj(cal_group, btn_plus1);
	lv_group_add_obj(cal_group, btn_ok1);

	lv_group_add_obj(cal_group, btn_min2);
	lv_group_add_obj(cal_group, ad_spinbox2);
	lv_group_add_obj(cal_group, btn_plus2);
	lv_group_add_obj(cal_group, btn_ok2);
	lv_group_add_obj(cal_group, btn_refr);

	lv_group_add_obj(cal_group, btn_min3);
	lv_group_add_obj(cal_group, ad_spinbox3);
	lv_group_add_obj(cal_group, btn_plus3);

	lv_group_add_obj(cal_group, btn_min4);
	lv_group_add_obj(cal_group, ad_spinbox4);
	lv_group_add_obj(cal_group, btn_plus4);
	lv_group_add_obj(cal_group, btn_ok4);
	lv_group_add_obj(cal_group, btn_ok5);

	lv_group_add_obj(cal_group, btn_save);
	lv_group_add_obj(cal_group, btn_cancel);
}

static void start_ad8307_cal()
{
	stop_measurement();
	f_cal_ad8307 = true;
}

